In [69]:
import pandas as pd
import numpy as np
import sqlite3

In [70]:
conn = sqlite3.connect('produkty_zajecia.db')

In [71]:
c = conn.cursor()

In [72]:
c.execute('''
CREATE TABLE IF NOT EXISTS produkty
          ([produkt_id] INTEGER PRIMARY KEY, [nazwa_produktu] TEXT)
''')

In [73]:
c.execute('''
CREATE TABLE IF NOT EXISTS ceny
          ([produkt_id] INTEGER PRIMARY KEY, [cena] integer)
''')

In [74]:
conn.commit()

In [75]:
c.execute('''
INSERT INTO produkty (produkt_id, nazwa_produktu)

VALUES
          (1, 'Komputer'),
          (2, 'Monitor'),
          (3, 'Mysz'),
          (4, 'Klawiatura'),
          (5, 'Drukarka')
''')

conn.commit()

In [76]:
c.execute('''
INSERT INTO ceny (produkt_id, cena)

VALUES
          (1, 1500),
          (2, 2000),
          (3, 50),
          (4, 100),
          (5, 1400)
''')

conn.commit()

In [79]:
c.execute(
    '''
    SELECT a.nazwa_produktu, b.cena FROM produkty a LEFT JOIN ceny b ON a.produkt_id = b.produkt_id
    '''
)

df = pd.DataFrame(c.fetchall(), columns = ['Nazwa produktu', 'Cena'])
df.head()

  Nazwa produktu  Cena
0       Komputer  1500
1        Monitor  2000
2           Mysz    50
3     Klawiatura   100
4       Drukarka  1400

In [81]:
conn = sqlite3.connect('books.db')
c = conn.cursor()

c.execute('''
CREATE TABLE IF NOT EXISTS books
          ([produkt_id] INTEGER PRIMARY KEY, [nazwa_produktu] TEXT)
''')
conn.commit()
c.execute('''
CREATE TABLE IF NOT EXISTS authors
          ([produkt_id] INTEGER PRIMARY KEY, [nazwa_produktu] TEXT)
''')
conn.commit()
c.execute('''
CREATE TABLE IF NOT EXISTS ceny
          ([produkt_id] INTEGER PRIMARY KEY, [cena] integer)
''')
conn.commit()

c.execute('''
INSERT INTO books (produkt_id, nazwa_produktu)

VALUES
          (1, 'Komputer'),
          (2, 'Monitor'),
          (3, 'Mysz'),
          (4, 'Klawiatura'),
          (5, 'Drukarka')
''')

conn.commit()

c.execute('''
INSERT INTO authors (produkt_id, nazwa_produktu)

VALUES
          (1, 'Komputer'),
          (2, 'Monitor'),
          (3, 'Mysz'),
          (4, 'Klawiatura'),
          (5, 'Drukarka')
''')

conn.commit()

c.execute('''
INSERT INTO ceny (produkt_id, cena)

VALUES
          (1, 1500),
          (2, 2000),
          (3, 50),
          (4, 100),
          (5, 1400)
''')

conn.commit()

In [88]:
from sqlalchemy import create_engine, Column, Integer, String, ForeignKey, MetaData, Table
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

engine = create_engine('sqlite:///:memory:', echo=True)
Base = declarative_base()

In [89]:
class User(Base):
    __tablename__ = 'users'

    id = Column(Integer, primary_key=True)
    first_name = Column(String)
    last_name = Column(String)
    age = Column(Integer)

Base.metadata.create_all(engine)

2024-01-21 09:31:35,779 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-01-21 09:31:35,781 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("users")
2024-01-21 09:31:35,781 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-01-21 09:31:35,782 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("users")
2024-01-21 09:31:35,783 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-01-21 09:31:35,786 INFO sqlalchemy.engine.Engine
CREATE TABLE users (
	id INTEGER NOT NULL,
	first_name VARCHAR,
	last_name VARCHAR,
	age INTEGER,
	PRIMARY KEY (id)
)


2024-01-21 09:31:35,786 INFO sqlalchemy.engine.Engine [no key 0.00072s] ()
2024-01-21 09:31:35,787 INFO sqlalchemy.engine.Engine COMMIT

In [90]:
Session = sessionmaker(bind=engine)
session = Session()
user1 = User(first_name='Jan', last_name='Kowalski', age=34)
user2 = User(first_name='Adam', last_name='Nowak', age=23)
user3 = User(first_name='Anna', last_name='Kowalska', age=45)
user4 = User(first_name='Jan', last_name='Nowak', age=12)
user5 = User(first_name='Adam', last_name='Kowalski', age=56)

In [92]:
session.add_all([user1, user2, user3, user4, user5])
session.commit()

2024-01-21 09:31:56,719 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-01-21 09:31:56,722 INFO sqlalchemy.engine.Engine INSERT INTO users (first_name, last_name, age) VALUES (?, ?, ?)
2024-01-21 09:31:56,723 INFO sqlalchemy.engine.Engine [generated in 0.00102s] ('Jan', 'Kowalski', 34)
2024-01-21 09:31:56,725 INFO sqlalchemy.engine.Engine INSERT INTO users (first_name, last_name, age) VALUES (?, ?, ?)
2024-01-21 09:31:56,725 INFO sqlalchemy.engine.Engine [cached since 0.003239s ago] ('Adam', 'Nowak', 23)
2024-01-21 09:31:56,727 INFO sqlalchemy.engine.Engine INSERT INTO users (first_name, last_name, age) VALUES (?, ?, ?)
2024-01-21 09:31:56,728 INFO sqlalchemy.engine.Engine [cached since 0.006078s ago] ('Anna', 'Kowalska', 45)
2024-01-21 09:31:56,729 INFO sqlalchemy.engine.Engine INSERT INTO users (first_name, last_name, age) VALUES (?, ?, ?)
2024-01-21 09:31:56,731 INFO sqlalchemy.engine.Engine [cached since 0.008666s ago] ('Jan', 'Nowak', 12)
2024-01-21 09:31:56,732 INFO sqlalchemy.engine.Engine INSERT INTO users (first_name, last_name, age) VALUES (?, ?, ?)
2024-01-21 09:31:56,732 INFO sqlalchemy.engine.Engine [cached since 0.01007s ago] ('Adam', 'Kowalski', 56)
2024-01-21 09:31:56,733 INFO sqlalchemy.engine.Engine COMMIT

In [94]:
query = session.query(User).all()

for user in query:
    print(user.first_name, user.last_name, user.age)

session.close()

2024-01-21 09:36:16,226 INFO sqlalchemy.engine.Engine SELECT users.id AS users_id, users.first_name AS users_first_name, users.last_name AS users_last_name, users.age AS users_age
FROM users
2024-01-21 09:36:16,243 INFO sqlalchemy.engine.Engine [cached since 115s ago] ()
Jan Kowalski 34
Adam Nowak 23
Anna Kowalska 45
Jan Nowak 12
Adam Kowalski 56
2024-01-21 09:36:16,256 INFO sqlalchemy.engine.Engine ROLLBACK

In [100]:
def add_user(session:Session, last_name:str, first_name:str, age:int):
    new_user = User(first_name=first_name, last_name=last_name, age=age)
    session.add(new_user)
    session.commit()

def display_all_users(session:Session):
    query = session.query(User).all()
    for user in query:
        print(user.id, user.first_name, user.last_name, user.age)

def display_users_by_age(session:Session, age:int):
    query = session.query(User).filter(User.age == age).all()
    if query:
        for user in query:
            print(user.id, user.first_name, user.last_name, user.age)
    else:
        print('Brak użytkowników o podanym wieku')

In [101]:
class Book(Base):
    __tablename__ = 'books'

    id = Column(Integer, primary_key=True)
    title = Column(String)
    author = Column(String)
    published_year = Column(Integer)
    isbn = Column(Integer)

Base.metadata.create_all(engine)

Session = sessionmaker(bind=engine)
session = Session()
book1 = Book(title='Pan Tadeusz', author='Adam Mickiewicz', published_year=1834, isbn=123456789)
book2 = Book(title='Dziady', author='Adam Mickiewicz', published_year=1832, isbn=123456788)
book3 = Book(title='Lalka', author='Bolesław Prus', published_year=1890, isbn=123456787)
book4 = Book(title='Chłopi', author='Władysław Reymont', published_year=1904, isbn=123456786)
book5 = Book(title='Lalka', author='Bolesław Prus', published_year=1890, isbn=123456787)

session.add_all([book1, book2, book3, book4, book5])
session.commit()

#funkcja na pobranie wszystkich książek
def display_all_books(session:Session):
    query = session.query(Book).all()
    for book in query:
        print(book.id, book.title, book.author, book.published_year, book.isbn)

#funkcja na dodanie książki
def add_book(session:Session, title:str, author:str, published_year:int, isbn:int):
    new_book = Book(title=title, author=author, published_year=published_year, isbn=isbn)
    session.add(new_book)
    session.commit()

#funkcja na zaaktualizowanie danych książki
def update_book(session:Session, id:int, title:str, author:str, published_year:int, isbn:int):
    book = session.query(Book).filter(Book.id == id).first()
    book.title = title
    book.author = author
    book.published_year = published_year
    book.isbn = isbn
    session.commit()

#funkcja na usunięcie książki
def delete_book(session:Session, id:int):
    book = session.query(Book).filter(Book.id == id).first()
    session.delete(book)
    session.commit()

2024-01-21 09:50:52,577 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-01-21 09:50:52,581 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("users")
2024-01-21 09:50:52,582 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-01-21 09:50:52,585 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("books")
2024-01-21 09:50:52,586 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-01-21 09:50:52,587 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("books")
2024-01-21 09:50:52,587 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-01-21 09:50:52,589 INFO sqlalchemy.engine.Engine
CREATE TABLE books (
	id INTEGER NOT NULL,
	title VARCHAR,
	author VARCHAR,
	published_year INTEGER,
	isbn INTEGER,
	PRIMARY KEY (id)
)


2024-01-21 09:50:52,590 INFO sqlalchemy.engine.Engine [no key 0.00094s] ()
2024-01-21 09:50:52,591 INFO sqlalchemy.engine.Engine COMMIT
2024-01-21 09:50:52,607 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-01-21 09:50:52,610 INFO sqlalchemy.engine.Engine INSERT INTO books (title, author, published_year, isbn) VALUES (?, ?, ?, ?)
2024-01-21 09:50:52,611 INFO sqlalchemy.engine.Engine [generated in 0.00085s] ('Pan Tadeusz', 'Adam Mickiewicz', 1834, 123456789)
2024-01-21 09:50:52,612 INFO sqlalchemy.engine.Engine INSERT INTO books (title, author, published_year, isbn) VALUES (?, ?, ?, ?)
2024-01-21 09:50:52,613 INFO sqlalchemy.engine.Engine [cached since 0.00311s ago] ('Dziady', 'Adam Mickiewicz', 1832, 123456788)
2024-01-21 09:50:52,614 INFO sqlalchemy.engine.Engine INSERT INTO books (title, author, published_year, isbn) VALUES (?, ?, ?, ?)
2024-01-21 09:50:52,614 INFO sqlalchemy.engine.Engine [cached since 0.004292s ago] ('Lalka', 'Bolesław Prus', 1890, 123456787)
2024-01-21 09:50:52,615 INFO sqlalchemy.engine.Engine INSERT INTO books (title, author, published_year, isbn) VALUES (?, ?, ?, ?)
2024-01-21 09:50:52,615 INFO sqlalchemy.engine.Engine [cached since 0.00551s ago] ('Chłopi', 'Władysław Reymont', 1904, 123456786)
2024-01-21 09:50:52,615 INFO sqlalchemy.engine.Engine INSERT INTO books (title, author, published_year, isbn) VALUES (?, ?, ?, ?)
2024-01-21 09:50:52,616 INFO sqlalchemy.engine.Engine [cached since 0.006086s ago] ('Lalka', 'Bolesław Prus', 1890, 123456787)
2024-01-21 09:50:52,617 INFO sqlalchemy.engine.Engine COMMIT